In [30]:
#실습
#다음 딕셔너리에서 value가 78인 key를 출력?
#반복문 사용
d={'height':180, 'weight':78, 'temparture':36, 'eyesight':1}

for i in d.items():
    if i[1]==78:
        print("key = ", i[0], "value = ", i[1])
        break

key =  weight value =  78

In [39]:
#위에꺼 이해돕기위한 예제
#딕셔너리에서 value가 78값인 key를 찾아서 출력
#국어, 영어, 수학 점수들이라고 가정
d = {'1반':[60,80,30],
    '2반':[78,54,98],
    '3반':[100,50,70],
    '4반':[70,60,80]}

for i in d.items():
    for g in i[1]:
        if g ==78:
            print (i[0], g)
        break

2반 78

In [48]:
#입력 n을 받아 1부터 n까지 연속한 숫자의 합을 구하는 함수 sum_n()을 이용하여 구하시오
#print(sum_n(10))
#print(sum_n(25))

n=int(input("숫자 "))
def sum_n(n):
    x=0
    for n in range(1,n+1):
       x = x+n
       #print("다음 수 : ", n, " 합계 : ", x) 문장으로 중간중간 확인하기
    return x
print(sum_n(n))

#print(sum_n(10))
#print(sum_n(25))

숫자 10
55

In [59]:
#실습
#1부터 10000까지 8이라는 숫자가 총 몇번 나오는가?
#1)범위에 해당하는 리스트를 만든다.
#2)리스트를 문자열로 만든다.
#3)'9'이 몇개 있는지 카운터 한다.

a=list(range(1,10000+1))
#print(a)
ac=str(a)
#tpye(ac)
print(ac.count('8'))

4000

In [64]:
number = ["1",'2','3','4','5','6']
x=" ".join(number)
x

'1 2 3 4 5 6'

In [73]:
#다음과 같은 데이터 프레임을 만드시요.

import pandas as pd

df=pd.DataFrame({'country':['벨기에', '인도', '브라질'],
                 'capital':['브뤼셀','뉴델리','브라질리아'],
                 'population':['1천만명','13억명','2억명']},
                 index = [0,1,2])
df

  country capital population
0     벨기에     브뤼셀       1천만명
1      인도     뉴델리       13억명
2     브라질   브라질리아        2억명

In [75]:
#인도의 인구를 14억명으로 바꾸세오.
df.loc[1,'population']='14억명'
df

  country capital population
0     벨기에     브뤼셀       1천만명
1      인도     뉴델리       14억명
2     브라질   브라질리아        2억명

In [80]:
# 아이스크림 빵 내기

#1)타이타닉 데이터셋 
#2)데이터는 총 몇건인가, 컬럼은 총 몇 개로 구성되어있나?
#3)결측치가 있는 컬럼은?
#4)Pclass는 몇개로구분되어있는가?
#5)남자,여자 각각 전체 평균 나이는?
#6)요금의 최소값, 최대값은 각각 얼마?

import pandas as pd

df=pd.read_csv('c:/Ohhhhh/titanic.csv')

df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [82]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [83]:
df.shape

(891, 12)

In [117]:
df.values.size

10692

In [88]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [89]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [93]:
df.groupby('Pclass').size()

Pclass
1    216
2    184
3    491
dtype: int64

In [114]:
df.groupby(['Sex']).mean()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
Sex,,,,,,,
female,431.028662,0.742038,2.159236,27.915709,0.694268,0.649682,44.479818
male,454.147314,0.188908,2.389948,30.726645,0.429809,0.235702,25.523893

In [96]:
df['Fare'].min()

0.0

In [97]:
df['Fare'].max()

512.3292